app/Http/Controllers/Auth/LoginController.php

select * from `aspirants` where `user_id` = 213 limit 1
---
    public function redirectPath()
    {
        $userAdministrator = \auth()->user()->hasRole('Administrador');
        $userAspirant = \auth()->user()->hasRole('Aspirante');
        $userCurador = \auth()->user()->hasRole('Curador');
        $userSubsanador = \auth()->user()->hasRole('Subsadanor');

        /*=============================================
            VALIDAMOS EL ROL
        =============================================*/
        if ($userAdministrator) {
            return route('reports.dashboard.page');
        } else if ($userAspirant) {
            /*=============================================
                VALIDAMOS EL ESTADO DEL ASPIRANTE
            =============================================*/
            $aspirant = Aspirant::where('user_id', \auth()->user()->id)->first();