app/Http/Controllers/Auth/ResetPasswordController.php

select * from `aspirants` where `user_id` = 213 limit 1
---
    protected function redirectTo()
    {

        if (auth()->user()->roles[0]->name == "Administrador") {
            return route('reports.dashboard.page');
        } else if (auth()->user()->roles[0]->name == "Aspirante") {
            $aspirant = Aspirant::where('user_id', auth()->user()->id)->first();