app/Http/Controllers/Aspirant/AccountController.php

    public function createAccount(Request $request)
    {
        $name = $request->get('name');
        $lastName = $request->get('last_name');
        $email = $request->get('email');

        $password = Str::random(8);
        $pass = bcrypt($password);
        $success = true;

        DB::beginTransaction();
        try {
            $user = User::create([
                'name' => ucwords($name),
                'last_name' => ucwords($lastName),
                'email' => $email,
                'password' => $pass
            ]);
            Aspirant::create([
                'user_id' => $user->id
            ]);
---
insert into `users` (`name`, `last_name`, `email`, `password`, `updated_at`, `created_at`) values ('Silvio Mauricio', 'Gutierrez Quiñones', 'silviotista93@gmail.com', '$2y$10$csrkVoXpatGjtoYqC3f6ROMzCke1No2cfG7eYaDe.wTNHtNEwd4T6', '2022-02-13 15:34:56', '2022-02-13 15:34:56')
insert into `aspirants` (`user_id`, `updated_at`, `created_at`) values (213, '2022-02-13 15:34:56', '2022-02-13 15:34:56')