app/Http/Controllers/Aspirant/ProfileController.php

        /*=============================================
                ACTUALIZAMOS EL USUARIO
        =============================================*/
        $user = User::where('id', $user_id)->update([
            'name' => ucwords($name),
            'last_name' => ucwords($last_name),
            'email' => $email,
            'phone' => $phone,
            'birthday' => $birthday,
            'address' => $address,
            'gender_id' => $genero->id,
            'city_id' => $city->id,
            'slug' => Str::slug($name . '-' . $last_name . Str::random(10))
        ]);
---
update `users` set `name` = 'Silvio Mauricio', `last_name` = 'Gutierrez Quiñones', `email` = 'silviotista93@gmail.com', `phone` = '(315) 494-0493', `birthday` = '2000-04-06 00:00:00', `address` = 'Calle 36N #4-113', `gender_id` = 1, `city_id` = 1, `slug` = 'silvio-mauricio-gutierrez-quinonesbt8mvnwtzt', `users`.`updated_at` = '2022-02-13 17:47:13' where `id` = '213'

            $document_minor = $request->document_minor;
            $extension_document_minor = $request->extension_document_minor;

            Minor::where('id', $minor_id)->update([
                'name' => ucwords($name_minor),
                'last_name' => ucwords($last_name_minor),
                'birthday' => $birthday_minor,
                'document' => $document_minor,
                'extension_document' => $extension_document_minor
            ]);
---
update `minors` set `name` = 'Samuel', `last_name` = 'Castro', `birthday` = '2005-09-12 19:00:00', `document` = '/storage/archives/samuel-castro-mzr0rhriqwidx1z.pdf', `extension_document` = 'pdf', `minors`.`updated_at` = '2022-02-13 17:47:13' where `id` = '1'

        /*=============================================
                    CREAMOS EL PROYECTO
            =============================================*/
        $project = Proyect::where('id', $project_id)->update([
            'title' => ucwords($project_name),
            'name_author' => ucwords($project_name_author),
            'description' => $project_description,
            'category_id' => $project_category->id,
            'audio' => $project_audio,
            'slug' => Str::slug($project_name . '-' . Str::random(10))
        ]);
---
update `proyects` set `title` = 'Sdsd', `name_author` = 'Sd', `description` = 'sds', `category_id` = 8, `audio` = '/storage/projects/sdsd-silvio-mauricio-gutierrez-quinones-yuri-buenaventura-tu-cancionmp3-principal-d2xsjawdly.mp3', `slug` = 'sdsd-cpw5hibmhd', `proyects`.`updated_at` = '2022-02-13 17:47:13' where `id` = '201'