app/Http/Controllers/Aspirant/RegisterController.php

    public function getAspirantType()
    {
        $aspirantType = AspirantType::all();
---
select * from `aspirant_types`