app/Http/Controllers/Controller.php

    public function getDepartaments(){
        $departaments = Departament::all();
---
select * from `departaments`

    public function getCities($id){
        $cities = City::where('iddepartamento', $id)->get();
---
select * from `cities` where `iddepartamento` = '1'

    public function getGenders(){
        $genders = Gender::all();
---
select * from `genders`

    public function getProjectCategories(){
        $categories = Category::all();
---
select * from `categories`

    public function validateEmail($email)
    {
        $check = User::whereEmail($email)->first();
---
select * from `users` where `email` = 'silviotista93@gmail.com' limit 1