app/Models/Aspirant.php

select * from `aspirant_types` where `aspirant_types`.`id` in (3)
select * from `aspirants` where `user_id` = 213 limit 1
select * from `categories` where `categories`.`id` in (8)
select * from `cities` where `cities`.`id` in (1)
---
    static public function getDataAspirant($id){
        $aspirant = Aspirant::where('user_id', $id)->with('user.gender', 'user.city.departament', 'aspirant_type', 'projects.category')->first();