app/Models/Aspirant.php

select * from `minors` where `minors`.`parent_id` in (1)
---
    static public function getDataAspirant($id){
        $aspirant = Aspirant::where('user_id', $id)->with('user.gender', 'user.city.departament', 'aspirant_type', 'projects.category', 'parent.minor', 'ethnic', 'categoryAspirant')->first();